export const sidebarItems = {
    news: [
        {title: "Общие новости", to: "/campus/news"},
        {
            title: "Активности", body: [
                {to: "/campus/activity/sport", children: "Спорт"},
                {to: "/campus/activity/events", children: "Мероприятия"},
                {to: "/campus/activity/execution", children: "Отработки"},
            ],
        },
        {
            title: "Заселение", body: [
                {to: "/campus/news/campus_new/campus_docs", children: "Порядок заселения"},
            ],
        }],
    rating: [
        {title: "Рейтинговая система", to: "/campus/rating/ratyng_system"},
        {title: "Список студентов", to: "/campus/rating/ratyng_system/students"},
    ],
    campus:[
        {title: "Рейтинговая система", to: "/campus/admin/rating_student"}
    ]
};

export const navbarItems = [
    {title: "Новости", to: "/campus/news"},
    {title: "Общежития", to: "/campus/campus_info"},
    {title: "Рейтинг", to: "/campus/rating/ratyng_system"},
    {title: "Контакты", to: "/campus/contacts"},
];


export const ratingConditions = [
    {num: "1", action: "Подготовка работы на Республиканский конкурс студенческих НИР или научная публикация", points: "70"},
    {num: "2", action: "Участие с докладом на МНТК", points: "50"},
    {num: "3", action: "Участие с докладом на СНТК", points: "30"},
    {num: "4", action: "Выполнение обязанностей старосты группы", points: "от 20 до 50"},
    {num: "5", action: "Выполнение обязанностей старосты этажа, председателя либо члена студсовета", points: "от 20 до 50"},
    {num: "6", action: "Участие в городских культурно-массовых  мероприятиях проводимых с участием вуза", points: "от 10 до 50"},
    {num: "7", action: "Непосредственное участие в организации культурно-массовых мероприятий проводимых в рамках вуза", points: "50"},
    {num: "8", action: "Непосредственное участие в организации культурно-массовых  мероприятиях проводимых на факультете и в общежитии", points: "30"},
    {num: "9", action: "Участие в культурно-массовых мероприятиях проводимых в рамках ВУЗа", points: "25"},
    {num: "10", action: "Участие в культурно-массовых мероприятиях проводимых на факультете и в общежитии", points: "15"},
    {num: "11", action: "Участие в спортивных мероприятиях в качестве члена сборной команды университета  в основном составе (в запасе)", points: "от 25 до 50"},
    {num: "12", action: "Участие в спортивных мероприятиях в качестве члена сборной команды факультета  в основном составе (в запасе)", points: "от 15 до 30"},
    {num: "13", action: "Средний балл за экзамены в сессию 9 и более", points: "70"},
    {num: "14", action: "Средний балл за экзамены в сессию 7 и более", points: "50"},
    {num: "15", action: "Средний балл по аттестации выше 4", points: "10"},
    {num: "16", action: "Сдача сессии без пересдачи", points: "20"},
    {num: "17", action: "Несвоевременная сдача экзаменов в сессию  - 1 экзамен", points: "-30"},
    {num: "18", action: "Несвоевременная сдача производственной практики", points: "-30"},
    {num: "19", action: "Отрицательная оценка в аттестацию  - 1 «двойка» (отметки от 1 до 4)", points: "-10"},
    {num: "20", action: "Пропуски занятий без уважительных причин  - 1 час", points: "-1"},
    {num: "21", action: "Антисанитарное состояние комнаты (блока); повторно", points: "-10; -20"},
    {num: "22", action: "Нарушение пропускного режима (без уважительных причин)", points: "-10"},
    {num: "23", action: "Нарушение правил электро- и пожаробезопасности; повторно", points: "-10; -30"},
    {num: "24", action: "Нарушение тишины в неустановленное время в общежитии; повторно", points: "-10; -20"},
    {num: "25", action: "Оставление посторонних лиц на ночлег, проникновение или помощь в проникновении в общежитие в не установленных местах", points: "-20"},
    {num: "26", action: "Несвоевременная сдача комнат и блоков при выселении", points: "-30"},
    {num: "27*", action: "Появление в нетрезвом виде в общежитии", points: "-15"},
    {num: "28*", action: "Распитие спиртных напитков в общежитии", points: "-30"},
    {num: "29", action: "Несвоевременная плата за общежитие", points: "-20"},
    {num: "30", action: "Невыполнение требований и решений, принятых студсоветом и сотрудниками общежития", points: "-30"},
];


export const urls = {};
